apple-open-source/macos/IOUSBFamily/AppleUSBHub/Classes/AppleUSBHubPort.cpp
	// If there is a resume pending, then wait until it happens
	while ( _resumePending and resumeRetries > 0 )
	{
		IOSleep(10);
		USBLog(5, "AppleUSBHubPort[%p]::SuspendPort(%s) for port %d, waiting for _resumePending %d", this, suspend ? "suspend" : "resume", (uint32_t)_portNum, (uint32_t)resumeRetries);
		resumeRetries--;
	}
	
	if ( resumeRetries == 0 )
	{
		USBLog(2, "AppleUSBHubPort[%p]::SuspendPort(%s) for port %d, did not clear the resumePending flag", this, suspend ? "suspend" : "resume", _portNum);
	}
	
    do {
		if (_hub->isInactive())
		{
			// if the hub is inactive, it is probably unplugged, so we can resume a port for free
			if (!suspend && (_portPMState == usbHPPMS_drvr_suspended))
			{
				USBLog(3, "AppleUSBHubPort[%p]::SuspendPort(resume) on port(%d)- Inactive hub, doing for free!", this, _portNum);
				if ( _portDevice && fromDevice)
				{
					IOUSBDevice *cachedDevice = _portDevice;			// in case _portDevice goes away while we are messaging
					
					if (cachedDevice)
					{
						cachedDevice->retain();
						cachedDevice->message(kIOUSBMessagePortHasBeenResumed, cachedDevice, NULL);
						cachedDevice->release();
						_portPMState = usbHPPMS_active;
					}
				}
			}
			else
			{
				USBLog(3, "AppleUSBHubPort[%p]::SuspendPort on port(%d) - not doing anything (%s) _portDevice(%p) _portPMState(%d) !", this, _portNum, suspend ? "suspend" : "resume", _portDevice, (int)_portPMState);
			}
			err = kIOReturnSuccess;
			break;
		}

        // If resuming, need to check that the port was suspended to begin with
        //
        err = _hub->GetPortStatus(&status, _portNum);
        if (kIOReturnSuccess != err)
        {
            USBLog(3,"AppleUSBHubPort[%p]::SuspendPort Could not get Port Status: 0x%x", this, err);
            break;
        }

		USBLog(5, "AppleUSBHubPort[%p]::SuspendPort - GetPortStatus returned status[%p] change[%p]", this, (void*)status.statusFlags, (void*)status.changeFlags );
        if (!suspend && !(status.statusFlags & kHubPortSuspend) )
        {
			USBLog(5,"AppleUSBHubPort[%p]::SuspendPort Port was NOT suspended", this);
           
			// We were trying to resume but the port was not supended.  Just ignore the
            // request, but send a message
            if ( _portDevice && fromDevice)
			{
				IOUSBDevice *cachedDevice = _portDevice;			// in case _portDevice goes away while we are messaging
				
				if (cachedDevice)
				{
					cachedDevice->retain();
					cachedDevice->message(kIOUSBMessagePortWasNotSuspended, cachedDevice, NULL);
					cachedDevice->release();
				}
			}
            break;
        }
        
        // OK, set up the handler for the set/clear suspend feature
		USBLog(7, "AppleUSBHubPort[%p]::SuspendPort - setting vector to HandleSuspendPortHandler", this);
		SetPortVector(&AppleUSBHubPort::HandleSuspendPortHandler, kHubPortSuspend);
        if (suspend)
        {
			if (fromDevice)
			{
				if (_portPMState == usbHPPMS_pm_suspended)
				{
					USBLog(3, "AppleUSBHubPort[%p]::SuspendPort - converting suspend state from pm_suspended to drvr_suspended statusFlags(%p)", this, (void*)status.statusFlags);
					if (status.statusFlags & kHubPortSuspend)
					{
						IOUSBControllerV3		*v3Bus = NULL;
						IOReturn				err;
						
						if (_hub)
						{
							if (_hub->_device)
								v3Bus = OSDynamicCast(IOUSBControllerV3, _hub->_device->GetBus());
							
							if (v3Bus && _portDevice)
							{
								USBLog(5, "AppleUSBHub[%p]::SuspendPort - Enabling endpoints for device at address (%d)", this, (int)_portDevice->GetAddress());
								err = v3Bus->EnableAddressEndpoints(_portDevice->GetAddress(), true);
								if (err)
								{
									USBLog(2, "AppleUSBHub[%p]::SuspendPort - EnableAddressEndpoints returned (%p)", this, (void*)err);
								}
							}
						}
					}
					else
					{
						USBError(1, "AppleUSBHub[%p]::SuspendPort - expected port to be suspended for conversion, but it is not!!", this);
					}
				}
				_portPMState = usbHPPMS_drvr_suspended;
			}
			else
			{
				_portPMState = usbHPPMS_pm_suspended;
			}
			
            err = _hub->SetPortFeature(kUSBHubPortSuspendFeature, _portNum);
            if ( err != kIOReturnSuccess )
            {
                // Root Hub failed for lucent bug
                //
                // Callback device with the resume message
                USBLog(3, "AppleUSBHubPort[%p]::SuspendPort Could not SetPortFeature (%d) (kUSBHubPortSuspendFeature): (0x%x)", this, _portNum, err);
                if ( _portDevice && fromDevice)
				{
					IOUSBDevice *cachedDevice = _portDevice;			// in case _portDevice goes away while we are messaging
					
					if (cachedDevice)
					{
						cachedDevice->retain();
						cachedDevice->message(kIOUSBMessagePortHasBeenResumed, cachedDevice, NULL);
						cachedDevice->release();
					}
				}
				err = kIOReturnSuccess;
            }
			else
			{
				// Send a message to our device indicating that we completed the SetPortFeature
				if ( _portDevice && fromDevice)
				{
					IOUSBDevice *cachedDevice = _portDevice;			// in case _portDevice goes away while we are messaging
					
					if (cachedDevice)
					{
						cachedDevice->retain();
						cachedDevice->message(kIOUSBMessagePortHasBeenSuspended, cachedDevice, &err);
						cachedDevice->release();
					}
				}
			}
        }
        else
        {
 			USBLog(5, "AppleUSBHubPort[%p]::SuspendPort - calling ClearPortFeature", this);
			err = _hub->ClearPortFeature(kUSBHubPortSuspendFeature, _portNum);
            if ( err != kIOReturnSuccess )
            {
                USBLog(3, "AppleUSBHubPort[%p]::SuspendPort Could not ClearPortFeature (%d) (kUSBHubPortSuspendFeature): (0x%x)", this, _portNum, err);
            }
			
			// Set up a flag indicating that we are expecting a resume port status change
			_resumePending = true;
 			USBLog(2, "AppleUSBHubPort[%p]::SuspendPort - RESUME - calling RaisePowerState on hub[%p] port %d and setting _lowerPowerStateOnResume", this, _hub, _portNum);
			_hub->RaisePowerState();				// make sure that the hub is at a good power state until the resume is done
			if (_lowerPowerStateOnResume)
			{
				USBLog(1, "AppleUSBHubPort[%p]::SuspendPort - RESUME - _lowerPowerStateOnResume already set (hub %p port %d)- UNEXPECTED!", this, _hub, _portNum);
			}
			USBLog(5, "AppleUSBHubPort[%p]::SuspendPort - RESUME - setting _lowerPowerStateOnResume - (hub %p port %d)", this, _hub, _portNum);
			_lowerPowerStateOnResume = true;
        }
    } while (false);

    if ( err != kIOReturnSuccess )
    {
		// Send a message to our device indicating that we got an error
		if ( _portDevice && fromDevice)
		{
			IOUSBDevice *cachedDevice = _portDevice;			// in case _portDevice goes away while we are messaging
			
			if (cachedDevice)
			{
				cachedDevice->retain();
				cachedDevice->message(kIOUSBMessagePortHasBeenSuspended, cachedDevice, &err);
				cachedDevice->release();
			}
		}
		
        // Set the handler back to default
        //
		USBLog(7, "AppleUSBHubPort[%p]::SuspendPort - setting vector to DefaultSuspendChangeHandler", this);
        SetPortVector(&AppleUSBHubPort::DefaultSuspendChangeHandler, kHubPortSuspend);
    }
    
